----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,408
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5           [-1, 64, 56, 56]          36,864
       BatchNorm2d-6           [-1, 64, 56, 56]             128
              ReLU-7           [-1, 64, 56, 56]               0
            Conv2d-8           [-1, 64, 56, 56]          36,864
       BatchNorm2d-9           [-1, 64, 56, 56]             128
             ReLU-10           [-1, 64, 56, 56]               0
       BasicBlock-11           [-1, 64, 56, 56]               0
           Conv2d-12           [-1, 64, 56, 56]          36,864
      BatchNorm2d-13           [-1, 64, 56, 56]             128
             ReLU-14           [-1, 64, 56, 56]               0
           Conv2d-15           [-1, 64, 56, 56]          36,864
      BatchNorm2d-16           [-1, 64, 56, 56]             128
             ReLU-17           [-1, 64, 56, 56]               0
       BasicBlock-18           [-1, 64, 56, 56]               0
           Conv2d-19           [-1, 64, 56, 56]          36,864
      BatchNorm2d-20           [-1, 64, 56, 56]             128
             ReLU-21           [-1, 64, 56, 56]               0
           Conv2d-22           [-1, 64, 56, 56]          36,864
      BatchNorm2d-23           [-1, 64, 56, 56]             128
             ReLU-24           [-1, 64, 56, 56]               0
       BasicBlock-25           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-26             [-1, 64, 1, 1]               0
           Conv2d-27              [-1, 4, 1, 1]             256
             ReLU-28              [-1, 4, 1, 1]               0
           Conv2d-29             [-1, 64, 1, 1]             256
AdaptiveMaxPool2d-30             [-1, 64, 1, 1]               0
           Conv2d-31              [-1, 4, 1, 1]             256
             ReLU-32              [-1, 4, 1, 1]               0
           Conv2d-33             [-1, 64, 1, 1]             256
          Sigmoid-34             [-1, 64, 1, 1]               0
 ChannelAttention-35             [-1, 64, 1, 1]               0
           Conv2d-36            [-1, 1, 56, 56]              98
          Sigmoid-37            [-1, 1, 56, 56]               0
 SpatialAttention-38            [-1, 1, 56, 56]               0
             CBAM-39           [-1, 64, 56, 56]               0
           Conv2d-40          [-1, 128, 28, 28]          73,728
      BatchNorm2d-41          [-1, 128, 28, 28]             256
             ReLU-42          [-1, 128, 28, 28]               0
           Conv2d-43          [-1, 128, 28, 28]         147,456
      BatchNorm2d-44          [-1, 128, 28, 28]             256
           Conv2d-45          [-1, 128, 28, 28]           8,192
      BatchNorm2d-46          [-1, 128, 28, 28]             256
             ReLU-47          [-1, 128, 28, 28]               0
       BasicBlock-48          [-1, 128, 28, 28]               0
           Conv2d-49          [-1, 128, 28, 28]         147,456
      BatchNorm2d-50          [-1, 128, 28, 28]             256
             ReLU-51          [-1, 128, 28, 28]               0
           Conv2d-52          [-1, 128, 28, 28]         147,456
      BatchNorm2d-53          [-1, 128, 28, 28]             256
             ReLU-54          [-1, 128, 28, 28]               0
       BasicBlock-55          [-1, 128, 28, 28]               0
           Conv2d-56          [-1, 128, 28, 28]         147,456
      BatchNorm2d-57          [-1, 128, 28, 28]             256
             ReLU-58          [-1, 128, 28, 28]               0
           Conv2d-59          [-1, 128, 28, 28]         147,456
      BatchNorm2d-60          [-1, 128, 28, 28]             256
             ReLU-61          [-1, 128, 28, 28]               0
       BasicBlock-62          [-1, 128, 28, 28]               0
           Conv2d-63          [-1, 128, 28, 28]         147,456
      BatchNorm2d-64          [-1, 128, 28, 28]             256
             ReLU-65          [-1, 128, 28, 28]               0
           Conv2d-66          [-1, 128, 28, 28]         147,456
      BatchNorm2d-67          [-1, 128, 28, 28]             256
             ReLU-68          [-1, 128, 28, 28]               0
       BasicBlock-69          [-1, 128, 28, 28]               0
AdaptiveAvgPool2d-70            [-1, 128, 1, 1]               0
           Conv2d-71              [-1, 8, 1, 1]           1,024
             ReLU-72              [-1, 8, 1, 1]               0
           Conv2d-73            [-1, 128, 1, 1]           1,024
AdaptiveMaxPool2d-74            [-1, 128, 1, 1]               0
           Conv2d-75              [-1, 8, 1, 1]           1,024
             ReLU-76              [-1, 8, 1, 1]               0
           Conv2d-77            [-1, 128, 1, 1]           1,024
          Sigmoid-78            [-1, 128, 1, 1]               0
 ChannelAttention-79            [-1, 128, 1, 1]               0
           Conv2d-80            [-1, 1, 28, 28]              98
          Sigmoid-81            [-1, 1, 28, 28]               0
 SpatialAttention-82            [-1, 1, 28, 28]               0
             CBAM-83          [-1, 128, 28, 28]               0
           Conv2d-84          [-1, 256, 14, 14]         294,912
      BatchNorm2d-85          [-1, 256, 14, 14]             512
             ReLU-86          [-1, 256, 14, 14]               0
           Conv2d-87          [-1, 256, 14, 14]         589,824
      BatchNorm2d-88          [-1, 256, 14, 14]             512
           Conv2d-89          [-1, 256, 14, 14]          32,768
      BatchNorm2d-90          [-1, 256, 14, 14]             512
             ReLU-91          [-1, 256, 14, 14]               0
       BasicBlock-92          [-1, 256, 14, 14]               0
           Conv2d-93          [-1, 256, 14, 14]         589,824
      BatchNorm2d-94          [-1, 256, 14, 14]             512
             ReLU-95          [-1, 256, 14, 14]               0
           Conv2d-96          [-1, 256, 14, 14]         589,824
      BatchNorm2d-97          [-1, 256, 14, 14]             512
             ReLU-98          [-1, 256, 14, 14]               0
       BasicBlock-99          [-1, 256, 14, 14]               0
          Conv2d-100          [-1, 256, 14, 14]         589,824
     BatchNorm2d-101          [-1, 256, 14, 14]             512
            ReLU-102          [-1, 256, 14, 14]               0
          Conv2d-103          [-1, 256, 14, 14]         589,824
     BatchNorm2d-104          [-1, 256, 14, 14]             512
            ReLU-105          [-1, 256, 14, 14]               0
      BasicBlock-106          [-1, 256, 14, 14]               0
          Conv2d-107          [-1, 256, 14, 14]         589,824
     BatchNorm2d-108          [-1, 256, 14, 14]             512
            ReLU-109          [-1, 256, 14, 14]               0
          Conv2d-110          [-1, 256, 14, 14]         589,824
     BatchNorm2d-111          [-1, 256, 14, 14]             512
            ReLU-112          [-1, 256, 14, 14]               0
      BasicBlock-113          [-1, 256, 14, 14]               0
          Conv2d-114          [-1, 256, 14, 14]         589,824
     BatchNorm2d-115          [-1, 256, 14, 14]             512
            ReLU-116          [-1, 256, 14, 14]               0
          Conv2d-117          [-1, 256, 14, 14]         589,824
     BatchNorm2d-118          [-1, 256, 14, 14]             512
            ReLU-119          [-1, 256, 14, 14]               0
      BasicBlock-120          [-1, 256, 14, 14]               0
          Conv2d-121          [-1, 256, 14, 14]         589,824
     BatchNorm2d-122          [-1, 256, 14, 14]             512
            ReLU-123          [-1, 256, 14, 14]               0
          Conv2d-124          [-1, 256, 14, 14]         589,824
     BatchNorm2d-125          [-1, 256, 14, 14]             512
            ReLU-126          [-1, 256, 14, 14]               0
      BasicBlock-127          [-1, 256, 14, 14]               0
AdaptiveAvgPool2d-128            [-1, 256, 1, 1]               0
          Conv2d-129             [-1, 16, 1, 1]           4,096
            ReLU-130             [-1, 16, 1, 1]               0
          Conv2d-131            [-1, 256, 1, 1]           4,096
AdaptiveMaxPool2d-132            [-1, 256, 1, 1]               0
          Conv2d-133             [-1, 16, 1, 1]           4,096
            ReLU-134             [-1, 16, 1, 1]               0
          Conv2d-135            [-1, 256, 1, 1]           4,096
         Sigmoid-136            [-1, 256, 1, 1]               0
ChannelAttention-137            [-1, 256, 1, 1]               0
          Conv2d-138            [-1, 1, 14, 14]              98
         Sigmoid-139            [-1, 1, 14, 14]               0
SpatialAttention-140            [-1, 1, 14, 14]               0
            CBAM-141          [-1, 256, 14, 14]               0
          Conv2d-142            [-1, 512, 7, 7]       1,179,648
     BatchNorm2d-143            [-1, 512, 7, 7]           1,024
            ReLU-144            [-1, 512, 7, 7]               0
          Conv2d-145            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-146            [-1, 512, 7, 7]           1,024
          Conv2d-147            [-1, 512, 7, 7]         131,072
     BatchNorm2d-148            [-1, 512, 7, 7]           1,024
            ReLU-149            [-1, 512, 7, 7]               0
      BasicBlock-150            [-1, 512, 7, 7]               0
          Conv2d-151            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-152            [-1, 512, 7, 7]           1,024
            ReLU-153            [-1, 512, 7, 7]               0
          Conv2d-154            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-155            [-1, 512, 7, 7]           1,024
            ReLU-156            [-1, 512, 7, 7]               0
      BasicBlock-157            [-1, 512, 7, 7]               0
          Conv2d-158            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-159            [-1, 512, 7, 7]           1,024
            ReLU-160            [-1, 512, 7, 7]               0
          Conv2d-161            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-162            [-1, 512, 7, 7]           1,024
            ReLU-163            [-1, 512, 7, 7]               0
      BasicBlock-164            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-165            [-1, 512, 1, 1]               0
          Conv2d-166             [-1, 32, 1, 1]          16,384
            ReLU-167             [-1, 32, 1, 1]               0
          Conv2d-168            [-1, 512, 1, 1]          16,384
AdaptiveMaxPool2d-169            [-1, 512, 1, 1]               0
          Conv2d-170             [-1, 32, 1, 1]          16,384
            ReLU-171             [-1, 32, 1, 1]               0
          Conv2d-172            [-1, 512, 1, 1]          16,384
         Sigmoid-173            [-1, 512, 1, 1]               0
ChannelAttention-174            [-1, 512, 1, 1]               0
          Conv2d-175              [-1, 1, 7, 7]              98
         Sigmoid-176              [-1, 1, 7, 7]               0
SpatialAttention-177              [-1, 1, 7, 7]               0
            CBAM-178            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-179            [-1, 512, 1, 1]               0
         Flatten-180                  [-1, 512]               0
         Dropout-181                  [-1, 512]               0
          Linear-182                   [-1, 27]          13,851
================================================================
Total params: 21,385,955
Trainable params: 21,385,955
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 99.30
Params size (MB): 81.58
Estimated Total Size (MB): 181.46